{
  "basics": {
    "name": "Jacob Ebey",
    "label": "Software Engineer",
    "picture": "images/me.png",
    "email": "jacob.ebey@live.com",
    "phone": "206-578-7230",
    "website": "https://jacob-ebey.js.org",
    "summary": "Self-motivated engineer with 6+ years experience, a passion for the latest tech and delivering products that have an impact on people's lives.",
    "location": {
      "city": "Seattle",
      "countryCode": "US",
      "region": "Washington"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "jacob-ebey",
        "url": "https://github.com/jacob-ebey"
      }
    ]
  },
  "work": [
    {
      "company": "Alaska Airlines - Alaska Pay",
      "position": "Software Engineer",
      "website": "https://www.alaskaair.com",
      "startDate": "Feb 2019",
      "endDate": "July 2019 ",
      "summary": "Contributing to the new payment processing system that spans Inflight and Airports while modernizing an existing legacy system that handles automated phone routing.",
      "highlights": [
        "Working within both ASP .Net Framework and ASP .Net Core projects.",
        "Building an Electron application to assist in re-processing or writting off transactions.",
        "Utilizing a GraphQL endpoint to minimize data transfer between the back-end and Electron application."
      ]
    },
    {
      "company": "Microsoft - AI & Knowledge",
      "position": "Software Engineer",
      "website": "https://microsoft.com",
      "startDate": "Aug 2018",
      "endDate": "Jan 2019",
      "summary": "Building a Data Catalog to allow exploration of data-sets owned by Microsoft allowing data-scientists to spend less time locating and prepping data, and more time gaining insights and building models.",
      "highlights": [
        "Back-end is written in Node.JS (Typescript) utilizing GraphQL and Neo4j.",
        "UX leverages React (hooks) and deferred rendering to deliver the best user experience possible.",
        "Easily add new or locate existing data-sets through a file-system like UX with advanced search capabilities."
      ]
    },
    {
      "company": "Microsoft - AI & Knowledge",
      "position": "Software Engineer",
      "website": "https://microsoft.com",
      "startDate": "Jan 2018",
      "endDate": "Aug 2018",
      "summary": "Designed a graph visualization of the Microsoft Customer Master to allow exploration and deeper data insights.",
      "highlights": [
        "Aggregated data from multiple data-sources into a coherent data-model with GraphQL.",
        "Back-end was built using ASP.Net Core and uses Azure Active Directory for s2s and user authentication.",
        "UX leverages React and the Apollo Client to maintain a clean application state in a data heavy application."
      ]
    },
    {
      "company": "Microsoft - Rewards",
      "position": "Software Engineer",
      "website": "https://www.microsoft.com/rewards",
      "startDate": "Jan 2017",
      "endDate": "Dec 2017",
      "summary": "Built and maintained a tool that allows teams such as marketing to configure everything from Quizzes to Rewards with the option to implement custom logic without needing to understand software.",
      "highlights": [
        "The UX leverages React/Redux creating reusable UX components and maintaining a clean application state in a data heavy application.",
        "The WebAPI is built using ASP.Net Core and uses Azure Active Directory for s2s and user authentication."
      ]
    },
    {
      "company": "Microsoft - Sales",
      "position": "Software Engineer",
      "website": "https://oneview.microsoft.com/Error?httpStatus=Unauthorized",
      "startDate": "July 2016",
      "endDate": "Jan 2017",
      "summary": "Built and maintained OneView, a tool to reduce prep time for sales calls by providing a holistic view of the business or entity by aggregating data from throughout the many orgs, as well as providing a layer of machine learning to increase sale chance.",
      "highlights": [
        "Xamarin Forms was chosen for the UX which lead to the need for the creation of many custom controls and platform specific renderers for iOS Android and UWP.",
        "Prism was chosen to easily share business logic between platforms.",
        "I created a thin abstraction around a few testing frameworks as no single one existed for all three platforms at the time allowing for consolidated UI tests."
      ]
    },
    {
      "company": "OMAX Corporation",
      "position": "Software Developer",
      "website": "https://www.omax.com/",
      "startDate": "May 2013",
      "endDate": "July 2016",
      "summary": "As a general-purpose engineer, I worked on projects from 3D CAM applications, to mobile applications, to embedded machine control.",
      "highlights": [
        "Developed features for the Intelli-MAX product suite such as the chamfer and spiral lead tools.",
        "Played an integral part in brining the scripting engine to a point that allows third party developers to distribute their own tools.",
        "Played a major role in building out the core architecure of OMAX Intelli-CAM, the first 3D CAM application for Waterjet applications.",
        "Build from the ground up, an OpenGL renderer to support linux and mobile systems.",
        "Developed a proof of concept monitoring application that never saw the light of day.",
        "Did the initial research into EtherCAT for what would become the next gen machine control scheme."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "FIRST Robotics",
      "position": "Volunteer",
      "website": "https://www.firstinspires.org/",
      "startDate": "Feb 2009",
      "endDate": "Current",
      "summary": "Starting as a student of FIRST, I now spend as much time as possible volunteering with local teams.",
      "highlights": [
        "Contributed to the RobotPY project enabling teams to program their TI CompactRIO in python.",
        "In 2011, I was the first person to get the Xbox Kinect to work with the TI CompactRIO.",
        "Started 2 FIRST Lego Leagues and 3 FIRST Lego Leagues Jr. at a Shorewood Elementary School in 2012 kick-starting a successful program that is now ran by staff and other volunteers."
      ]
    }
  ],
  "awards": [
    {
      "title": "FIRST Deans List",
      "date": "2012",
      "awarder": "Dean Kamen",
      "summary": "Celebrates outstanding student leaders whose passion for and effectiveness at attaining FIRST ideals is exemplary."
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "Master",
      "keywords": [
        "HTML",
        "CSS",
        "TypeScript",
        "React",
        "NodeJS",
        "ASP.Net Core"
      ]
    },
    {
      "name": "Mobile Development",
      "level": "advanced",
      "keywords": [
        "Android",
        "React Native",
        "Xamarin",
        "Xamarin.Forms"
      ]
    },
    {
      "name": "Desktop Development",
      "level": "Intermediate",
      "keywords": [
        "WPF",
        "UWP",
        "Electron",
        "WinForms"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "ASL",
      "fluency": "Rudimentary"
    }
  ],
  "interests": [
    {
      "name": "Automotive",
      "keywords": [
        "Turbos",
        "Fueling",
        "Tuning"
      ]
    },
    {
      "name": "Machine Learning",
      "keywords": [
        "Tensorflow",
        "Tensorflow.js"
      ]
    }
  ],
  "references": [
    {
      "name": "Shane Patton | Principal Software Engineer, Microsoft – AI & Knowledge",
      "reference": "Jacob is a super capable full stack developer with broad knowledge and a ton of ingenuity. He has great design instincts; you can throw really hard problems at him and be confident in a high quality, thoughtful design and solution. Very quick learner and an excellent thinker. Produces elegant high quality code that simplifies future maintenance; actively refactors to improve."
    }
  ]
}